6장 모듈과 패키지 
패키지에 대해서
jdk 주요 패키지 그중에서 
java.lang 중에서 object(무조건)
tostring equals 재정의해서 class간의 비교 하는거 나옴
예제6-2 어떤역할 하는지 예제6-3 
wrapper 클래스의 종류 
math클래스 언급도안함
뒤에 참고 되어있는거 x

7장
컬렉션과 제네릭
벡터클래스 사용하는방법 알아야됨 시험문제나옴
기본적인 예제
24번째사진 
lterator 이터레이터 
기본적인 형태 나옴

제네릭 만들기
예제7-6 스택예제는 구현 가능정도로
자바스윙기초 간단한 예제 1개 보여주고 구멍 뚫어서 코드 적기 
다음거에서 문제 1개 정도
스윙컴퍼넌트활용은 생략 
 

12장
자바 쓰레드
기본적인 예제는 제작하고 이해해야됨
스레드 동기화 간단한예제 31번째 사진 왜wait쓰이는지 등등 
 카운트문제 시계문제 타이머
 

13장
입출력 스트림
문자스트림 바이트스트림
클래스6가지,6가지
스트림 이용해서 파일 입출력을 하는지 간단한예제들
텍스트 파일

14장 
자바소켓에서 문제1개 교재에 나온 가장 간단한 소켓 프로그램 예제 위주로 보기
소켓 만드는 방법 코드 구멍 뚫어놈
